buoyantBoussinesqSimpleFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    inner
    {
        type            fixedValue;
        value           uniform 1;
    }

    outer
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(frontPlane|backPlane)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
