buoyantBoussinesqSimpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          85;
        startFace       9548;
    }
    outer
    {
        type            wall;
        inGroups        1(wall);
        nFaces          85;
        startFace       9633;
    }
    
    frontPlane
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4845;
        startFace       9718;
    }
    backPlane
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4845;
        startFace       14563;
    }
)

// ************************************************************************* //
